Autodesk.Revit.DB.FabricationConnectorInfo.HasDoubleWallConnector
Checks if there are any double wall connectors fabricated.
Returns:
True if there are any double wall connectors fabricated.
Since:
2016

Autodesk.Revit.DB.FabricationConnectorInfo.IsValid
Checks if the connector has fabrication parameters associated with it that can be set.
Returns:
True if the connector has fabrication parameters associated with it that can be set.
Since:
2016

Autodesk.Revit.DB.FabricationConnectorInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FabricationConnectorInfo.IsDoubleWallConnectorLocked
Fabrication double wall connector lock.
Remarks:
If set this prevents the connector value being overridden by the fabrication specification.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
No double wall connector available.
-or-
When setting this property: the connector cannot be modified on an owned fabrication part.
-or-
When setting this property: the connector is already connected.
-or-
When setting this property: the fabrication part is connected to more than one item.
Since:
2016

Autodesk.Revit.DB.FabricationConnectorInfo.DoubleWallConnectorId
Fabrication double wall connector Id.
Remarks:
A reference to the fabrication configuration connectors.
Setting the connector value will also set the connector lock.
A value of 0 indicates no connector.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: doubleWallConnectorId is invalid based on the shape and domain.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
No double wall connector available.
-or-
When setting this property: the connector cannot be modified on an owned fabrication part.
-or-
When setting this property: the connector is already connected.
-or-
When setting this property: the fabrication part is connected to more than one item.
Since:
2016

Autodesk.Revit.DB.FabricationConnectorInfo.FabricationIndex
The index of the connector shown within the fabrication software.
Since:
2016

Autodesk.Revit.DB.FabricationConnectorInfo.IsBodyConnectorLocked
Fabrication body connector lock.
Remarks:
If set this prevents the connector value being overridden by the fabrication specification.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: the connector cannot be modified on an owned fabrication part.
-or-
When setting this property: the connector is already connected.
-or-
When setting this property: the fabrication part is connected to more than one item.
Since:
2016

Autodesk.Revit.DB.FabricationConnectorInfo.BodyConnectorId
Fabrication body connector Id.
Remarks:
A reference to the fabrication configuration connectors.
Setting the connector value will also set the connector lock.
A value of 0 indicates the connector is set to none.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: bodyConnectorId is invalid based on the shape and domain.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: the connector cannot be modified on an owned fabrication part.
-or-
When setting this property: the connector is already connected.
-or-
When setting this property: the fabrication part is connected to more than one item.
Since:
2016

Autodesk.Revit.DB.FabricationConnectorInfo
Fabrication connector information.
Since:
2016